target/test-classes/requests/ET_Create_Ticket.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>expresst</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">etkt0813</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap-env:Header>
    <soap-env:Body>
        <ns0:createTicketRequest xmlns:ns0="http://aots.att.com/ticket/v1">
            <ns1:WSHeader xmlns:ns1="http://cio.att.com/commonheader/v3">
                <ns1:WSContext>
                    <ns1:FromAppId>ETT_aotsCreateTicket</ns1:FromAppId>
                    <ns1:SourceIPAddress>express-ticketing-api-65697c7f48-2lwfm</ns1:SourceIPAddress>
                </ns1:WSContext>
            </ns1:WSHeader>
            <ns0:createTicketInput>
                <ns2:AutoUpdateable xmlns:ns2="http://tktsvc.aots.att.com/ticket">Create Ticket</ns2:AutoUpdateable>
                <ns3:ClientTicketNum xmlns:ns3="http://tktsvc.aots.att.com/ticket"></ns3:ClientTicketNum>
                <ns4:FunctionalArea xmlns:ns4="http://tktsvc.aots.att.com/ticket">GLOBAL_AM</ns4:FunctionalArea>
                <ns5:ProblemAbstract xmlns:ns5="http://tktsvc.aots.att.com/ticket">Express Ticketing: Test HSIA </ns5:ProblemAbstract>
                <ns6:ReptRequestType xmlns:ns6="http://tktsvc.aots.att.com/ticket">Fault</ns6:ReptRequestType>
                <ns7:ReptSvcImpactFlag xmlns:ns7="http://tktsvc.aots.att.com/ticket">Yes</ns7:ReptSvcImpactFlag>
                <ns8:Severity xmlns:ns8="http://tktsvc.aots.att.com/ticket">1 - Critical</ns8:Severity>
                <ns9:TicketType xmlns:ns9="http://tktsvc.aots.att.com/ticket">WEB</ns9:TicketType>
                <ns10:ManagingOrg xmlns:ns10="http://tktsvc.aots.att.com/ticket">US-ENTBB</ns10:ManagingOrg>
                <ns11:ReportedBy xmlns:ns11="http://tktsvc.aots.att.com/ticket">Mohit Chawla</ns11:ReportedBy>
                <ns12:ReportPhone xmlns:ns12="http://tktsvc.aots.att.com/ticket">3149717211</ns12:ReportPhone>
                <ns13:NextCheckTime xmlns:ns13="http://tktsvc.aots.att.com/ticket">1636397038</ns13:NextCheckTime>
                <ns14:TicketSource xmlns:ns14="http://tktsvc.aots.att.com/ticket">ETT</ns14:TicketSource>
                <ns15:TroubleReptDescText xmlns:ns15="http://tktsvc.aots.att.com/ticket">CIRCUIT_DOWN</ns15:TroubleReptDescText>
                <ns16:ReporterEmailAddr xmlns:ns16="http://tktsvc.aots.att.com/ticket">mc9844@att.com</ns16:ReporterEmailAddr>
                <ns17:AuthTest xmlns:ns17="http://tktsvc.aots.att.com/ticket">Y</ns17:AuthTest>
                <ns18:PowerToCPE xmlns:ns18="http://tktsvc.aots.att.com/ticket">Y</ns18:PowerToCPE>
                <ns19:TroubleReptCode xmlns:ns19="http://tktsvc.aots.att.com/ticket">51</ns19:TroubleReptCode>
                <ns20:DispatchAuthorized xmlns:ns20="http://tktsvc.aots.att.com/ticket">N</ns20:DispatchAuthorized>
                <ns21:Notes xmlns:ns21="http://tktsvc.aots.att.com/ticket">This is an online ticket created by the Customer in Express Ticketing</ns21:Notes>
                <ns22:UserID xmlns:ns22="http://tktsvc.aots.att.com/ticket">ETT</ns22:UserID>
                <ns23:ValidateContactInfo xmlns:ns23="http://tktsvc.aots.att.com/ticket">Yes</ns23:ValidateContactInfo>
                <ns24:ValidateDispatchAuth xmlns:ns24="http://tktsvc.aots.att.com/ticket">Yes</ns24:ValidateDispatchAuth>
                <ns25:ValidateLCONInfo xmlns:ns25="http://tktsvc.aots.att.com/ticket">Yes</ns25:ValidateLCONInfo>
                <ns26:ValidateLocationAccessHours xmlns:ns26="http://tktsvc.aots.att.com/ticket">Yes</ns26:ValidateLocationAccessHours>
                <ns27:ValidatePowerToCPE xmlns:ns27="http://tktsvc.aots.att.com/ticket">Yes</ns27:ValidatePowerToCPE>
                <ns28:ValidateTestAuth xmlns:ns28="http://tktsvc.aots.att.com/ticket">Yes</ns28:ValidateTestAuth>
            </ns0:createTicketInput>
            <ns0:assetInput>
                <ns29:ActiveOrg xmlns:ns29="http://tktsvc.aots.att.com/ticket">US-ENTBB-SA</ns29:ActiveOrg>
                <ns30:AssetID xmlns:ns30="http://tktsvc.aots.att.com/ticket">1354161_1</ns30:AssetID>
                <ns31:ClientName xmlns:ns31="http://tktsvc.aots.att.com/ticket">SAGE DENTAL 4031285</ns31:ClientName>
                <ns32:OrgGroup xmlns:ns32="http://tktsvc.aots.att.com/ticket">US-ENTBB</ns32:OrgGroup>
                <ns33:ReptSvcLineDescText xmlns:ns33="http://tktsvc.aots.att.com/ticket">Broadband Access</ns33:ReptSvcLineDescText>
                <ns34:AssetType xmlns:ns34="http://tktsvc.aots.att.com/ticket">Circuit</ns34:AssetType>
                <ns35:CircuitID xmlns:ns35="http://tktsvc.aots.att.com/ticket">1354161_1</ns35:CircuitID>
                <ns36:EndUserName xmlns:ns36="http://tktsvc.aots.att.com/ticket">Mohit Chawla</ns36:EndUserName>
                <ns37:EndUserPhone xmlns:ns37="http://tktsvc.aots.att.com/ticket">3149717211</ns37:EndUserPhone>
                <ns38:LocationCountry xmlns:ns38="http://tktsvc.aots.att.com/ticket">USA</ns38:LocationCountry>
                <ns39:LocationStateProvince xmlns:ns39="http://tktsvc.aots.att.com/ticket">FL</ns39:LocationStateProvince>
                <ns40:LocationDetailsInfoList xmlns:ns40="http://tktsvc.aots.att.com/ticket">
                    <ns40:LocationDetailsInfo>
                        <ns40:LocationContactName>Mohit Chawla</ns40:LocationContactName>
                        <ns40:LocationContactPhone>3149717211</ns40:LocationContactPhone>
                        <ns40:LocationContactEmail>mc9844@att.com</ns40:LocationContactEmail>
                        <ns40:PremiseAccessHoursInfoList>
                            <ns40:AccessHoursInfo>
                                <ns40:DayOfWeek>Mon</ns40:DayOfWeek>
                                <ns40:Start>08:00</ns40:Start>
                                <ns40:End>17:00</ns40:End>
                            </ns40:AccessHoursInfo>
                            <ns40:AccessHoursInfo>
                                <ns40:DayOfWeek>Tue</ns40:DayOfWeek>
                                <ns40:Start>08:00</ns40:Start>
                                <ns40:End>17:00</ns40:End>
                            </ns40:AccessHoursInfo>
                            <ns40:AccessHoursInfo>
                                <ns40:DayOfWeek>Wed</ns40:DayOfWeek>
                                <ns40:Start>08:00</ns40:Start>
                                <ns40:End>17:00</ns40:End>
                            </ns40:AccessHoursInfo>
                            <ns40:AccessHoursInfo>
                                <ns40:DayOfWeek>Thu</ns40:DayOfWeek>
                                <ns40:Start>08:00</ns40:Start>
                                <ns40:End>17:00</ns40:End>
                            </ns40:AccessHoursInfo>
                            <ns40:AccessHoursInfo>
                                <ns40:DayOfWeek>Fri</ns40:DayOfWeek>
                                <ns40:Start>08:00</ns40:Start>
                                <ns40:End>17:00</ns40:End>
                            </ns40:AccessHoursInfo>
                            <ns40:AccessHoursInfo>
                                <ns40:DayOfWeek>Sat</ns40:DayOfWeek>
                                <ns40:Start>Closed</ns40:Start>
                                <ns40:End>Closed</ns40:End>
                            </ns40:AccessHoursInfo>
                            <ns40:AccessHoursInfo>
                                <ns40:DayOfWeek>Sun</ns40:DayOfWeek>
                                <ns40:Start>Closed</ns40:Start>
                                <ns40:End>Closed</ns40:End>
                            </ns40:AccessHoursInfo>
                        </ns40:PremiseAccessHoursInfoList>
                        <ns40:LocationDetailsType>L</ns40:LocationDetailsType>
                    </ns40:LocationDetailsInfo>
                </ns40:LocationDetailsInfoList>
                <ns41:EndUserEmail xmlns:ns41="http://tktsvc.aots.att.com/ticket">mc9844@att.com</ns41:EndUserEmail>
            </ns0:assetInput>
            <ns0:createControlInput>
                <ns42:AssetLookupType xmlns:ns42="http://tktsvc.aots.att.com/ticket">CIRCUIT</ns42:AssetLookupType>
                <ns43:CircuitFormat xmlns:ns43="http://tktsvc.aots.att.com/ticket">S</ns43:CircuitFormat>
            </ns0:createControlInput>
        </ns0:createTicketRequest>
    </soap-env:Body>
</soap-env:Envelope>